import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:twaf/app/Shared/Colors/Colors.dart';
import 'package:twaf/app/Shared/Style/Text_Style.dart';

class FatwaController extends GetxController {
  
  // late List<bool> isOpen;
  // late List<ExpansionPanel> list;
 var isExpantion = false.obs;
  @override
  void onInit() {
   
    super.onInit();
    // isOpen = [false, false];

    // list = [
    //   ExpansionPanel(
    //     backgroundColor: kcardgray,
    //     headerBuilder: (BuildContext context, bool isExpanded) {
    //       return ExpansionTile(
    //         backgroundColor: kcardgray,

    //         // contentPadding: EdgeInsets.all(12),
    //         leading: Image.asset(
    //           "assets/Icons/Save.png",
    //           color: kgoldColor,
    //           height: 44,
    //           width: 44,
    //         ),
    //         title: Text(
    //           'العمرة واجبة في العمر مرة',
    //           style: kGray_16b,
    //         ),

    //         children: [
    //           Text(
    //             'ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ',
    //             style: kGray_14r,
    //           ),
    //         ],
    //       );
    //     },
    //     body: ExpansionTile(
    //       backgroundColor: kgoldColor,
    //       title: Text(
    //         'ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ',
    //         style: kGray_14r,
    //       ),
    //     ),
    //     isExpanded: isOpen[0],
    //   )
    // ];
  }

  getOnExpantion(bool isExpan) {
    isExpantion.value = isExpan;
    update();
  }

  // onChange(int index, bool isExpanded) {
  //   isOpen[index] = !isExpanded;

  //   list = [
  //     ExpansionPanel(
  //       backgroundColor: kcardgray,
  //       headerBuilder: (BuildContext context, bool isExpanded) {
  //         return ListTile(
  //           // contentPadding: EdgeInsets.all(12),
  //           leading: Image.asset(
  //             "assets/Icons/Save.png",
  //             color: kgoldColor,
  //             height: 44,
  //             width: 44,
  //           ),
  //           title: Text(
  //             'العمرة واجبة في العمر مرة',
  //             style: kGray_16b,
  //           ),

  //           selected: true,
  //           onTap: () {},
  //         );
  //       },
  //       body: ListTile(
  //         title: Text(
  //           'ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها ',
  //           style: kGray_14r,
  //         ),
  //       ),
  //       isExpanded: isOpen[0],
  //     ),
  //   ];
  //   update();
  // }

  @override
  void onReady() {
    super.onReady();
  }

  @override
  void onClose() {}
}
